import numpy as np
from pathlib import Path

# ==========================================
# 1. パス・ディレクトリ設定
# ==========================================
PROJECT_ROOT = Path(__file__).parent
DATA_DIR = PROJECT_ROOT / "img" # SSDならパス置く
OUTPUT_DIR = PROJECT_ROOT / "output" # 結果も本番はSSDに置く

if not OUTPUT_DIR.exists():
    OUTPUT_DIR.mkdir(parents=True)

# 解析対象のエネルギーリスト (ディレクトリ名と一致させる)
ENERGY_LIST = ["13500", "14000", "14500", "15000", "15500", "16000", "16500", "17000"]

# 角度範囲
THETA_START = 0
THETA_END = 75     # 0-75 (計76点)
PHI_START = 0
PHI_END = 1439     # 0-1439 (計1440点)

# ==========================================
# 2. 画像データ仕様
# ==========================================
IMG_WIDTH = 512
IMG_HEIGHT = 128
HEADER_SIZE = 1024
RAW_DTYPE = np.uint16

# ==========================================
# 3. 解析物理パラメータ
# ==========================================
# 固定中心座標 (x, y)
FIXED_CENTER = (250, 65)

# 解析対象のピーク位置 (半径 r [px])
# ※ ピークフィッティングまたは積分の中心として使用
ROI_TARGETS = {
    "Bi": 20,   # Uデータから抽出
    "Sm": 0,    # L-U差分から抽出
    "Fe": 125   # L-U差分から抽出
}

# 積分/フィッティングを行う範囲（ピーク中心からの幅 ±px）
ROI_WIDTH = 10 

# ==========================================
# 4. その他
# ==========================================
DEBUG_MODE = True # 本番はFalse